blog/Backendload_test2/__next.blog.$c$slug.__PAGE__.txt
1:"$Sreact.fragment"
4f:I[97367,["/_next/static/chunks/ff1a16fafef87110.js","/_next/static/chunks/d2be314c3ece3fbe.js"],"OutletBoundary"]
50:"$Sreact.suspense"
:HL["/images/Backend/jwt_vs_session.png","image"]
:HL["/images/Backend/k6_load_test.png","image"]
:HL["/images/Backend/k6_Grafana.png","image"]
:HL["/images/Backend/grafana_result.png","image"]
:HL["/images/Backend/session_load_1.png","image"]
:HL["/images/Backend/jwt_load_1.png","image"]
:HL["/images/Backend/load_testing.png","image"]
:HL["/images/Backend/session_load_2.png","image"]
:HL["/images/Backend/jwt_load_2.png","image"]
0:{"buildId":"dqHky8X3JJ52IheEXne4g","rsc":["$","$1","c",{"children":[["$","article",null,{"className":"mt-10","children":[["$","header",null,{"className":"mb-8 border-b border-slate-200 pb-6","children":[["$","p",null,{"className":"text-sm text-slate-500","children":"2025년 7월 20일"}],["$","h1",null,{"className":"mt-2 text-4xl font-extrabold tracking-tight text-slate-900","children":"JWT와 Session의 성능 차이는 어떻게 될까? – 부하테스트 2"}],["$","p",null,{"className":"mt-3 text-lg text-slate-600","children":"부하테스트 진행"}]]}],["$","div",null,{"className":"prose prose-slate max-w-none","children":[["$","img",null,{"src":"/images/Backend/jwt_vs_session.png","width":"100%","height":"100%"}],"\n",["$","h4",null,{"children":"JWT와 Session의 성능 차이는 어떻게 될까?"}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":["$","a",null,{"href":"/blog/backend/load-test-1/","children":"부하테스트 1 - 부하테스트 개요 및 환경 구성"}]}],"\n",["$","li",null,{"children":[["$","a",null,{"href":"/blog/backend/load-test-2/","children":"부하테스트 2 - 부하테스트 진행"}],"  ⬅️ 현재글"]}],"\n",["$","li",null,{"children":["$","a",null,{"href":"/blog/backend/load-test-3/","children":"부하테스트 3 - 부하테스트 정리 및 회고"}]}],"\n"]}],"\n",["$","hr",null,{}],"\n",["$","p",null,{"children":["부하테스트 두번째 글로 부하테스트를 어떻게 진행했는지 말해보고자 한다.",["$","br",null,{}],"\n","진행하며 어떠한 문제점이 있었고 어떻게 개선하였는지 작성하고자 하였다."]}],"\n",["$","ol",null,{"children":["\n",["$","li",null,{"children":["$","strong",null,{"children":"단일 K6 부하테스트 진행"}]}],"\n",["$","li",null,{"children":["$","strong",null,{"children":"K6 + InfluxDB + Grafana / 시계열 데이터 분석"}]}],"\n",["$","li",null,{"children":["$","strong",null,{"children":"K6 + telegraf + InfluxDb + Grafana /  시스템 메트릭 추가"}]}],"\n"]}],"\n",["$","p",null,{"children":"이러한 순서로 진행하였다."}],"\n",["$","hr",null,{}],"\n",["$","h2",null,{"children":"1. 단일 K6 부하테스트 진행"}],"\n",["$","img",null,{"src":"/images/Backend/k6_load_test.png","width":"100%","height":"100%"}],"\n",["$","p",null,{"children":["처음으로 진행한 것은 K6를 설치하고 바로 부하 테스트를 진행해본 것이였다.",["$","br",null,{}],"\n","현재 시스템에서 어느정도 버틸 수 있는지 모르는 것도 있었고 부하테스트에 대한 감을 잡지 못한 상태여서 일단 먼저 부하를 걸어보았다."]}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"vuser : 10 ~ 5000 vus"}],"\n",["$","li",null,{"children":"시간 : 30s ~ 10m"}],"\n",["$","li",null,{"children":["테스트 유형 : ",["$","strong",null,{"children":"일정 vuser로 시작"}]," 또는 ",["$","strong",null,{"children":"0부터 지정한 vuser까지 상승"}]]}],"\n"]}],"\n",["$","p",null,{"children":"조건을 계속해서 바꿔가면서 부하를 걸어보는 과정을 거쳤다."}],"\n",["$","p",null,{"children":"다음은 진행했던 여러 테스트 중 하나의 k6 결과물이다."}],"\n",["$","pre",null,{"children":["$","code",null,{"children":"█ TOTAL RESULTS \n  checks_total......: 504789 1551.230026/s\n  checks_succeeded..: 99.93% 504462 out of 504789\n  checks_failed......: 0.06%  327 out of 504789\n\n  ✗ status is 200\n    ↳  99% — ✓ 504462 / ✗ 327\n\n  HTTP\n  http_req_duration.............: avg=524.24ms min=0s       med=128.67ms max=3.18s  p(90)=1.84s p(95)=2.29s\n    { expected_response:true }..: avg=524.58ms min=646.58µs med=129.04ms max=3.18s  p(90)=1.84s p(95)=2.29s\n  http_req_failed...............: 0.06%  327 out of 504789\n  http_reqs.....................: 504789 1551.230026/s\n\n  EXECUTION\n  iteration_duration............: avg=1.54s    min=1s       med=1.13s    max=31.02s p(90)=2.84s p(95)=3.3s \n  iterations....................: 504789 1551.230026/s\n  vus...........................: 5      min=5             max=4993\n  vus_max.......................: 5000   min=5000          max=5000\n\n  NETWORK\n  data_received.................: 237 MB 728 kB/s\n  data_sent.....................: 191 MB 588 kB/s\n"}]}],"\n",["$","p",null,{"children":"정리하면 다음과 같다."}],"\n",["$","ul",null,{"children":["\n",["$","li",null,{"children":"504462 요청 성공 / 327 요청 실패, 실패율 0.06%"}],"\n",["$","li",null,{"children":"평균 처리시간 524.24ms"}],"\n",["$","li",null,{"children":"p95 처리시간(95%를 포함하는 처리 시간) 2.29s"}],"\n"]}],"\n",["$","p",null,{"children":["최대 vuser 5000까지 진행해 보았는데 계속해서 수치를 높혀 진행해도 처리가 되긴 하였다.",["$","br",null,{}],"\n","다만 p95값이 너무 크게 나오고 실패율이 낮긴하지만 실패가 발생하였다."]}],"\n",["$","p",null,{"children":"vuser 5000이면 RPS 5000이 나온다는 것인데 너무 수치가 높게 나와 무엇인가 잘못되었다고 생각하였다. (사실 처리가 가능한 시스템이였다...)"}],"\n",["$","p",null,{"children":"결론적으로 다음으로 개선이 필요하다고 생각하였다."}],"\n",["$","ul",null,{"children":["\n","$L2","\n","$L3","\n"]}],"\n","$L4","\n","$L5","\n","$L6","\n","$L7","\n","$L8","\n","$L9","\n","$La","\n","$Lb","\n","$Lc","\n","$Ld","\n","$Le","\n","$Lf","\n","$L10","\n","$L11","\n","$L12","\n","$L13","\n","$L14","\n","$L15","\n","$L16","\n","$L17","\n","$L18","\n","$L19","\n","$L1a","\n","$L1b","\n","$L1c","\n","$L1d","\n","$L1e","\n","$L1f","\n","$L20","\n","$L21","\n","$L22","\n","$L23","\n","$L24","\n","$L25","\n","$L26","\n","$L27","\n","$L28","\n","$L29","\n","$L2a","\n","$L2b","\n","$L2c","\n","$L2d","\n","$L2e","\n","$L2f","\n","$L30","\n","$L31","\n","$L32","\n","$L33","\n","$L34","\n","$L35","\n","$L36","\n","$L37","\n","$L38","\n","$L39","\n","$L3a","\n","$L3b","\n","$L3c","\n","$L3d","\n","$L3e","\n","$L3f","\n","$L40","\n","$L41","\n","$L42","\n","$L43","\n","$L44","\n","$L45","\n","$L46","\n","$L47","\n","$L48","\n","$L49","\n","$L4a","\n","$L4b","\n","$L4c","\n","$L4d"]}]]}],null,"$L4e"]}],"loading":null,"isPartial":false}
2:["$","li",null,{"children":[["$","strong",null,{"children":"테스트 유형을 정하고 진행하자."}],["$","br",null,{}],"\n","내가 필요한 테스트는 무엇일까?라는 생각이 들어 테스트에 대해 찾아보았다.",["$","br",null,{}],"\n","-> 일정 vuser을 한번에 진행하는 것이 아닌 점차 증가시키는 ",["$","strong",null,{"children":"임계점 테스트"}]," 진행"]}]
3:["$","li",null,{"children":[["$","strong",null,{"children":"K6 결과물만으로는 원하는 결과를 파악하기 어렵다."}],["$","br",null,{}],"\n","K6 결과물은 일정 목표 수치를 정하고 이를 기반으로 테스트했을때 참고하기 좋은 형식이라고 생각하였다.",["$","br",null,{}],"\n","예시로 처리시간을 기준으로 이야기하면 전체 평균 처리시간이 결과로 나오기 때문에 임계점 테스트시\nuser가 적을때의 결과값과 클때의 결과값이 섞여 판단하기 어렵게 된다.",["$","br",null,{}],"\n","(ex 초기 처리시간 50ms, 후기 처리시간 1s 이라면 결과에서는 200ms로 정상값으로 보일 수 있음)",["$","br",null,{}],"\n","-> ",["$","strong",null,{"children":"시계열로 어느 지점에서 수치가 변화하는지 확인할 필요가 있다."}]]}]
4:["$","hr",null,{}]
5:["$","h2",null,{"children":["2. ",["$","strong",null,{"children":"K6 + InfluxDB + Grafana / 시계열 데이터 분석"}]]}]
6:["$","p",null,{"children":"테스트 유형을 정하는 한편 시계열 데이터를 저장하기 위한 InfluxDB, 이러한 정보를 시각적으로 표현하기 위해 Grafana를 사용하였다."}]
7:["$","img",null,{"src":"/images/Backend/k6_Grafana.png","width":"100%","height":"100%"}]
8:["$","p",null,{"children":"influxDB는 prometheus라는 대체제가 있었는데 간단하게 사용할 수 있다고 판단하여 influxDB를 선택했다."}]
9:["$","p",null,{"children":"추가적으로 여기서부터는 Docker도 추가하였는데 로컬에 설치하여 사용할 수도 있었으나 Docker-Compose를 사용하여 쉽게 환경을 구성하고도 싶었고\n이러한 내용을 Git으로 기록(유지)하고도 싶었기 때문에 사용하였다."}]
a:["$","img",null,{"src":"/images/Backend/grafana_result.png","width":"100%","height":"100%"}]
b:["$","blockquote",null,{"children":["\n",["$","p",null,{"children":["$","strong",null,{"children":"이제 시간대별로 수치가 어떻게 변화하는지 확인할 수 있게 됐다."}]}],"\n"]}]
c:["$","ul",null,{"children":["\n",["$","li",null,{"children":"시간 : 5m"}],"\n",["$","li",null,{"children":"Vuser : 0 에서 5000까지 vuser 증가"}],"\n"]}]
d:["$","p",null,{"children":"해당 조건으로 각각 session과 jwt 방식으로 진행한 후 분석해 보았다."}]
e:["$","p",null,{"children":"추후 시간이 너무 짧지 않은가 싶어 25분으로 증가율을 조정하여 실시했으나 비슷한 양상이였다."}]
f:["$","p",null,{"children":["확인한 수치는 ",["$","strong",null,{"children":"RPS, ERROR 발생 시간, P95 응답시간"}],"이다.",["$","br",null,{}],"\n","Vuser수가 동일하게 증가함으로 Vuser를 기준으로 임계지점을 나타내었다.",["$","br",null,{}],"\n","수치로 최대한 나타내려고 하였으나 임의적으로 나타낼 수 밖에 없는 부분이 많았던 것 같다."]}]
10:["$","h3",null,{"children":"세션 분석"}]
11:["$","img",null,{"src":"/images/Backend/session_load_1.png","width":"100%","height":"100%"}]
12:["$","h4",null,{"children":"RPS"}]
13:["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 2.20K 부분에서 추세 살짝 완만해짐, 그러나 계속 증가하는 추세",["$","br",null,{}],"\n","RPS 2.20K로 Vuser 수와 동일"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 2.67K 부분부터 RPS가 요동 치기 시작, 하지만 계속 증가하는 추세",["$","br",null,{}],"\n","RPS 2.57K로 Vuser보다 미달"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 3.47K 부분에서 RPS가 급격히 요동 치기 시작",["$","br",null,{}],"\n","RPS 3.47K이나 일시적 Vuser 수"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":"Vuser 4.28K 부분에서 RPS 3.73K으로 최대치 기록"}],"\n"]}],"\n"]}]
14:["$","p",null,{"children":["처음 추세가 완만해지는 부분이 빠르나 그 이후 임계점에 늦게 도달함",["$","br",null,{}],"\n","최대 RPS : ",["$","strong",null,{"children":"3.73K"}],", 임계점 : ",["$","strong",null,{"children":"3.47K"}]]}]
15:["$","h4",null,{"children":"ERROR"}]
16:["$","ul",null,{"children":["\n",["$","li",null,{"children":["Vuser 2.67K 부분에서 처음으로 ERROR 9건 발생",["$","br",null,{}],"\n","RPS 2.58K",["$","br",null,{}],"\n","이후 산발적으로 발생,"]}],"\n"]}]
17:["$","p",null,{"children":"ERROR가 발생하긴하나 특정한 패턴을 찾기 어려움"}]
18:["$","h4",null,{"children":"P95"}]
19:["$","ul",null,{"children":["\n",["$","li",null,{"children":["Vuser 3.00K 부분에서 578ms으로 상승",["$","br",null,{}],"\n","= 처음으로 500ms 이상으로 상승, 이후 p95 수치 점차 증가"]}],"\n"]}]
1a:["$","h3",null,{"children":"JWT 분석"}]
1b:["$","img",null,{"src":"/images/Backend/jwt_load_1.png","width":"100%","height":"100%"}]
1c:["$","h4",null,{"children":"RPS"}]
1d:["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 2.64K 부분에서 상승세 꺽임 = 시스템 임계점 근접",["$","br",null,{}],"\n","RPS 2.63K로 Vuser 수와 동일"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 2.94K 부분부터 RPS가 요동 치기 시작 = 시스템 임계점 도달",["$","br",null,{}],"\n","RPS 2.69K로 Vuser보다 미달",["$","br",null,{}],"\n","이전 단계인 상승세가 꺽인 부분부터 조금의 시간이 흐른 후 임계점 도달"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":"Vuser 3.59K 부분에서 RPS 3.47K으로 최대치 기록"}],"\n"]}],"\n"]}]
1e:["$","h4",null,{"children":"ERROR"}]
1f:["$","ul",null,{"children":["\n",["$","li",null,{"children":["Vuser 3.20K 부분에서 처음으로 ERROR 9건 발생",["$","br",null,{}],"\n","RPS 1.7K / 2.9K 변동\n이후 산발적으로 발생"]}],"\n"]}]
20:["$","h4",null,{"children":"P95"}]
21:["$","ul",null,{"children":["\n",["$","li",null,{"children":["Vuser 2.87K 부분에서 501ms으로 상승",["$","br",null,{}],"\n","= 처음으로 500ms 이상으로 상승, 이후 p95 수치 점차 증가"]}],"\n"]}]
22:["$","h3",null,{"children":"수치 분석"}]
23:["$","p",null,{"children":"전반적인 수치를 바탕으로 분석해보았을때 다음과 같다."}]
24:["$","h4",null,{"children":"RPS"}]
25:["$","ul",null,{"children":["\n",["$","li",null,{"children":[["$","strong",null,{"children":"세션방식(최대 RPS 3.73K)"}],", ",["$","strong",null,{"children":"JWT방식(최대 RPS 3.37K)"}],", 세션방식이 최대 RPS로 ",["$","strong",null,{"children":"10.7%"}]," 더 높음"]}],"\n",["$","li",null,{"children":["임계점을 안정적으로 RPS 수치를 내는 지점(RPS가 요동치기전)으로 하였을때",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션방식(최대 RPS 3.47K)"}],", ",["$","strong",null,{"children":"JWT방식(최대 RPS 2.94K)"}],", 세션방식이 ",["$","strong",null,{"children":"18.8%"}]," 더 높음"]}],"\n"]}]
26:["$","h4",null,{"children":"Error 발생 시점 및 분포"}]
27:["$","ul",null,{"children":["\n",["$","li",null,{"children":[["$","strong",null,{"children":"세션방식(Vuser 2.67K)"}],", ",["$","strong",null,{"children":"JWT방식(Vuser 3.20K)"}]," JWT방식이 오류 발생 시점이 더 늦음"]}],"\n"]}]
28:["$","h4",null,{"children":"응답시간"}]
29:["$","ul",null,{"children":["\n",["$","li",null,{"children":["전체 평균 응답시간",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션방식(315.35ms)"}],", ",["$","strong",null,{"children":"JWT방식(524.31ms)"}]," 세션방식이 전체 응답시간이 39.84% 빠름"]}],"\n",["$","li",null,{"children":["P95 응답시간",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션방식(1.31s)"}],", ",["$","strong",null,{"children":"JWT방식(2.30s)"}]," 세션방식이 P95 응답시간이 43.04% 빠름"]}],"\n",["$","li",null,{"children":["P95 기준 임계점(500ms 초과 시점)",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션방식(Vuser 3.00K)"}],", ",["$","strong",null,{"children":"JWT방식(Vuser 2.87K)"}]," 세션방식이 초과 시점이 늦음"]}],"\n"]}]
2a:["$","p",null,{"children":["정리하자면 ",["$","strong",null,{"children":"RPS 기준 10.7% ~ 18.8%"}],", ",["$","strong",null,{"children":"응답시간 기준 약 40%"}]," 정도 세션방식이 빠른것으로 말할 수 있다."]}]
2b:["$","h3",null,{"children":"다음으로는?"}]
2c:["$","p",null,{"children":["변화하는 수치를 보면서 CPU사용량등과 같이 시스템 메트릭 또한 참고해야하지 않을까 생각하였다.",["$","br",null,{}],"\n","RPS뿐만아니라 다양한 수치를 확인하고 이를 기준으로 임계점을 찾아보았는데\n시스템 메트릭 또한 임계점에 대한 기준으로 파악할 수 있을 뿐만 아니라 개선점을 찾기위한 필수적인 메트릭으로 생각하였기 때문이다."]}]
2d:["$","hr",null,{}]
2e:["$","h2",null,{"children":["3. ",["$","strong",null,{"children":"K6 + telegraf + InfluxDb + Grafana /  시스템 메트릭 추가"}]]}]
2f:["$","img",null,{"src":"/images/Backend/load_testing.png","width":"100%","height":"100%"}]
30:["$","p",null,{"children":"기존 구조에서 telegraf가 추가되었다."}]
31:["$","p",null,{"children":["프로메테우스 환경에서는 Node exporter를 사용하는 것 같고, 도커 내부에 시스템 메트릭을 보내주는 도구가 있다고는 들었는데",["$","br",null,{}],"\n","현재 로컬에서 서버를 사용하는 구조, influxDB를 사용하는 상황상 telegraf가 맞다고 생각하였다."]}]
32:["$","p",null,{"children":["주로 확인한 메트릭은 ",["$","strong",null,{"children":"CPU 사용률"}],",",["$","strong",null,{"children":"메모레 사용률"}],", ",["$","strong",null,{"children":"디스크 사용률"}],"이다.",["$","br",null,{}],"\n","기존과 동일한 상황에 시스템 메트릭만 추가하였다."]}]
33:["$","h3",null,{"children":"세션 분석"}]
34:["$","img",null,{"src":"/images/Backend/session_load_2.png","width":"100%","height":"100%"}]
35:["$","h4",null,{"children":"CPU 사용률"}]
36:["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 3.00K 부분에서 94.6%으로 처음으로 90% 도달, 시스템 임계점 근접",["$","br",null,{}],"\n","이후 90% 초반대로 점차 증가"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":"Vuser 3.70K 부분부터 98.1%로 이전까지는 90%후반 진입"}],"\n"]}],"\n"]}]
37:["$","h4",null,{"children":"메모리 사용률"}]
38:["$","ul",null,{"children":["\n",["$","li",null,{"children":"시작 64%에서 종료까지 점차 74%로 상승하였지만 특이사항 없음"}],"\n"]}]
39:["$","h4",null,{"children":"디스크 사용률"}]
3a:["$","ul",null,{"children":["\n",["$","li",null,{"children":"시작 48%에서 종료까지 점차 48.46으로 상승하였지만 특이사항 없음"}],"\n"]}]
3b:["$","h3",null,{"children":"JWT 분석"}]
3c:["$","img",null,{"src":"/images/Backend/jwt_load_2.png","width":"100%","height":"100%"}]
3d:["$","h4",null,{"children":"CPU 사용률"}]
3e:["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["Vuser 1.97K 부분에서 92.8%으로 처음으로 90% 도달, 시스템 임계점 근접",["$","br",null,{}],"\n","이후 90% 초반대로 점차 증가"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":"Vuser 2.80K 부분부터 98.2%로 이전까지는 90%초 였지만 100%대를 찍기시작"}],"\n"]}],"\n"]}]
3f:["$","p",null,{"children":"CPU 사용률이 전체적으로 강한 스파이크 형태를 보임"}]
40:["$","h4",null,{"children":"메모리 사용률"}]
41:["$","ul",null,{"children":["\n",["$","li",null,{"children":"시작 70%에서 종료까지 점차 76%로 상승하였지만 특이사항 없음"}],"\n"]}]
42:["$","h4",null,{"children":"디스크 사용률"}]
43:["$","ul",null,{"children":["\n",["$","li",null,{"children":"시작 48.46%에서 종료까지 점차 48.52%으로 상승하였지만 특이사항 없음"}],"\n"]}]
44:["$","h3",null,{"children":"수치 분석"}]
45:["$","h4",null,{"children":"CPU 사용률"}]
46:["$","ul",null,{"children":["\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["90% 초과 진입 시점",["$","br",null,{}],"\n",["$","strong",null,{"children":"세션 방식 Vuser 3.00K (94.6%)"}],", ",["$","strong",null,{"children":"JWT방식 Vuser 1.97K (92.8%)"}],["$","br",null,{}],"\n","JWT가 더 빠르게 CPU 임계점에 도달함 - 1.03K 차이"]}],"\n"]}],"\n",["$","li",null,{"children":["\n",["$","p",null,{"children":["98% 이상 진입 시점\n",["$","strong",null,{"children":"세션 방식 Vuser 3.70K (98.1%)"}],", ",["$","strong",null,{"children":"JWT 방식 Vuser 2.80K (98.2%)"}],"\nJWT가 더 이른 시점에 한계 도달 - 0.9K 차이는"]}],"\n"]}],"\n"]}]
47:["$","h4",null,{"children":"메모리 사용률 분석"}]
48:["$","ul",null,{"children":["\n",["$","li",null,{"children":"두 방식 모두 안정적인 사용패턴을 보이며 특이사항없음"}],"\n"]}]
49:["$","h4",null,{"children":"디스크 사용률 분석"}]
4a:["$","ul",null,{"children":["\n",["$","li",null,{"children":"두 방식 모두 안정적인 사용패턴을 보이며 특이사항없음"}],"\n"]}]
4b:["$","p",null,{"children":["확실히 CPU 사용량을 파악하니 성능차이가 더욱 도드라지게 보였다.",["$","br",null,{}],"\n","서명검증 및 디코딩등 연산이 많이 필요한 JWT방식에서 CPU사용량 임계점이 빨리 도달하였고 사용량의 안정성(스파이크)또한 JWT 방식이 더 낮았다."]}]
4c:["$","hr",null,{}]
4d:["$","p",null,{"children":["지금까지 진행했던 부분을 시간순서대로 작성하다보니 양이 많아진 것 같다.",["$","br",null,{}],"\n","다음 글에서는 간단한 정리 및 회고로 끝내보고자 한다."]}]
4e:["$","$L4f",null,{"children":["$","$50",null,{"name":"Next.MetadataOutlet","children":"$@51"}]}]
51:null